VDowbensky/Panchip/WHXY/SPL/Libraries/src/cw32w031_rcc.c
/**
 * @file cw32w031_rcc.c
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2022-7-12
 *
 * @copyright Copyright (c) 2021
 *
 */
/*******************************************************************************
 *
 * 代码许可和免责信息
 * 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
 * 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
 * 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
 * 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
 * 或条件。
 * 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
 * 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
 * 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
 * 损失。
 * 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
 * 全部上述排除或限制可能并不适用于您。
 *
 *******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "cw32w031_rcc.h"

/* Private_TypesDefinitions --------------------------------------------------*/
const uint32_t hsiprs_tbl[] = {6, 6, 6, 6, 6, 6, 1, 3, 2, 4, 6, 8, 10, 12, 14, 16};

/* Private_Defines -----------------------------------------------------------*/

/* Private_Variables ---------------------------------------------------------*/

/* Private_FunctionPrototypes ------------------------------------------------*/

/* Private_Functions ---------------------------------------------------------*/

/* Public_Functions ----------------------------------------------------------*/

/**
 * @brief 配置SysClk 到 HCLK的分频系数
 *
 * @param HCLKPRS ：RCC_HCLK_DIV1/2/4/8/16/32/64/128
 */
void RCC_HCLKPRS_Config(uint32_t HCLKPRS)
{
    assert_param(IS_RCC_HCLKPRS(HCLKPRS));
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~(SYSCTRL_BYPASS_MASK | SYSCTRL_CR0_HCLKPRS_Msk))) | SYSCTRL_BYPASS | HCLKPRS);
}
/**
 * @brief 配置HCLK 到 PCLK的分频系数
 *
 * @param PCLKPRS ：RCC_PCLK_DIV1/2/4/8
 */
void RCC_PCLKPRS_Config(uint32_t PCLKPRS)
{
    assert_param(IS_RCC_HCLKPRS(PCLKPRS));
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~(SYSCTRL_BYPASS_MASK | SYSCTRL_CR0_PCLKPRS_Msk))) | SYSCTRL_BYPASS | PCLKPRS);
}

/**
 * @brief 配置SysClk的时钟源
 *
 * @param SYSCLKSRC ：RCC_SYSCLKSRC_HSI RCC_SYSCLKSRC_HSE
 *                    RCC_SYSCLKSRC_LSI RCC_SYSCLKSRC_LSE
 */
void RCC_SYSCLKSRC_Config(uint32_t SYSCLKSRC)
{
    assert_param(IS_RCC_SYSCLKSRC(SYSCLKSRC));
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~(SYSCTRL_BYPASS_MASK | SYSCTRL_CR0_SYSCLK_Msk))) | SYSCTRL_BYPASS | SYSCLKSRC);
    RCC_SystemCoreClockUpdate(RCC_Sysctrl_GetHClkFreq());
}

/**
 * @brief 配置CLKCCS  HSECCS  LSECCS 功能
 *
 * @param CCS  ：RCC_SYSCTRL_LSECCS  RCC_SYSCTRL_HSECCS  RCC_SYSCTRL_CLKCCS
 * @param NewState  :ENABLE  DISABLE
 */
void RCC_CCS_Config(uint32_t CCS, FunctionalState NewState)
{
    assert_param(IS_RCC_CCS_STATUS(CCS));

    if (NewState != DISABLE)
    {
        CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) | CCS);
    }
    else
    {
        CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) & (~CCS));
    }
}

/**
 * @brief 配置LSELOCK功能：使能后软件无法关闭LSE时钟
 *
 * @param LSELOCK ： RCC_SYSCTRL_LSELOCKEN  RCC_SYSCTRL_LSELOCKDIS
 */
void RCC_LSELOCK_Config(uint32_t LSELOCK)
{
    assert_param(IS_RCC_LSELOCK_STATUS(LSELOCK));
    CW_SYSCTRL->CR1 = ((CW_SYSCTRL->CR1 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS | LSELOCK);
}

/**
 * @brief 配置WAKEUPCLK功能:决定从深度休眠模式唤醒后所使用的系统时钟源
 *
 * @param WAKEUPCLK ：RCC_SYSCTRL_WAKEUPCLKEN   RCC_SYSCTRL_WAKEUPCLKDIS
 */
void RCC_WAKEUPCLK_Config(uint32_t WAKEUPCLK)
{
    assert_param(IS_RCC_WAKEUPCLK_STATUS(WAKEUPCLK));
    CW_SYSCTRL->CR2 = ((CW_SYSCTRL->CR2 & (~(SYSCTRL_BYPASS_MASK | SYSCTRL_CR2_WAKEUPCLK_Msk))) | SYSCTRL_BYPASS | WAKEUPCLK);
}

/**
 * @brief 配置LOCK功能：决定异常故障后是否产生LOCKUP复位
 *
 * @param LOCKUP ：RCC_SYSCTRL_LOCKUPEN  RCC_SYSCTRL_LOCKUPDIS
 */
void RCC_LOCKUP_Config(uint32_t LOCKUP)
{
    assert_param(IS_RCC_LOCKUP_STATUS(LOCKUP));
    CW_SYSCTRL->CR2 = ((CW_SYSCTRL->CR2 & (~(SYSCTRL_BYPASS_MASK | SYSCTRL_CR2_LOCKUP_Msk))) | SYSCTRL_BYPASS | LOCKUP);
}

/**
 * @brief 配置端口SWDIO功能
 *
 * @param SWDIO  ：RCC_SYSCTRL_SWDIOEN   RCC_SYSCTRL_SWDIODIS
 */
void RCC_SWDIO_Config(uint32_t SWDIO)
{
    assert_param(IS_RCC_SWDIO_STATUS(SWDIO));
    CW_SYSCTRL->CR2 = ((CW_SYSCTRL->CR2 & (~(SYSCTRL_BYPASS_MASK | SYSCTRL_CR2_SWDIO_Msk))) | SYSCTRL_BYPASS | SWDIO);
}

/**
 * @brief  Resets the RCC clock configuration to the default reset state.
 * @param  None
 * @retval None
 * CAUTION:
 * 1、LSEEN Bit Not Changed ,so it will not affect RTC,BUT LSELOCK BIT Changed.
 * 2、Before CALL this funciton,we should set FLASH_CR2.WAT
 */
void RCC_DeInit(void)
{
    /* HSIEN Enable*/
    CW_SYSCTRL->CR1 = ((CW_SYSCTRL->CR1 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS | RCC_SYSCTRL_HSIEN);

    // Here need wait HSI STBALE
    while ((CW_SYSCTRL->HSI & SYSCTRL_HSI_STABLE_Msk) != SYSCTRL_HSI_STABLE_Msk) // Wait stable
    {
        ;
    }

    // CW_FLASH->CR2 =  ( ((CW_FLASH->CR2) & (~ SYSCTRL_BYPASS_MASK) ) | (uint32_t)0x5A5A0001 );
    /* SWITCH TO HSI*/
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS | RCC_SYSCLKSRC_HSI);

    /* HCLKPRS SET TO 000,PCLKPRS SET TO 00*/
    CW_SYSCTRL->CR0 = ((CW_SYSCTRL->CR0 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS | RCC_HCLK_DIV1 |
                       RCC_PCLK_DIV1 | RCC_SYSCLKSRC_HSI);

    /* CLKCCS/HSECCS/LSECCS/LSELOCK/LSIEN/HSEEN Disable   CLKCCS / LSEEN NO CHANGE*/
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS | RCC_SYSCTRL_HSIEN) & (~RCC_SYSCTRL_CLKCCS) & (~RCC_SYSCTRL_HSECCS) & (~RCC_SYSCTRL_LSECCS) & (~RCC_SYSCTRL_LSELOCKEN) & (~RCC_SYSCTRL_LSIEN) & (~RCC_SYSCTRL_HSEEN));

    /* SWDIO Enable,LOCKUP/WAKEUPCLK Disable*/
    CW_SYSCTRL->CR2 = (((((CW_SYSCTRL->CR2 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) & (~RCC_SYSCTRL_SWDIOEN)) & (~RCC_SYSCTRL_LOCKUPEN)) & (~RCC_SYSCTRL_WAKEUPCLKEN));

    /* Disable all interrupts */
    CW_SYSCTRL->IER = 0x5A5AFE00; // IER have KEY attribute

    /* Clear all pending bits  */
    CW_SYSCTRL->ICR &= 0xFFFFFE00;

    //外设时钟和复位寄存器设置 ??
}

/**
 * @brief
 *
 * @param NewFreq
 */
void RCC_SystemCoreClockUpdate(uint32_t NewFreq)
{
    SystemCoreClock = NewFreq;
}

/**
 * @brief 获得系统时钟（HCLK）频率值
 *
 * @return uint32_t   HCLK频率值(Hz)
 */
uint32_t RCC_Sysctrl_GetHClkFreq(void)
{
    uint32_t u32rtnVal = 0;
    uint32_t sysclksource = 0;
    uint32_t hsiprs = 0;

    sysclksource = CW_SYSCTRL->CR0_f.SYSCLK;
    hsiprs = CW_SYSCTRL->HSI_f.DIV;

    switch (sysclksource)
    {
    case 0x00: /* HSI used as system clock */
        u32rtnVal = (HSIOSC_VALUE / hsiprs_tbl[hsiprs]);
        break;
    case 0x01: /* HSE used as system clock */
        u32rtnVal = HSE_VALUE;
        break;
    case 0x03: /* LSI used as system clock */
        u32rtnVal = LSI_VALUE;
        break;
    case 0x04: /* LSE used as system clock */
        u32rtnVal = LSE_VALUE;
        break;
    default:
        u32rtnVal = (HSIOSC_VALUE / hsiprs_tbl[hsiprs]);
        break;
    }
    u32rtnVal = (u32rtnVal >> CW_SYSCTRL->CR0_f.HCLKPRS);
    return u32rtnVal;
}

/**
 * @brief 获得外设时钟（PCLK）频率值
 *
 * @return uint32_t    PCLK频率值(Hz)
 */
uint32_t RCC_Sysctrl_GetPClkFreq(void)
{
    uint32_t u32Val = 0;

    u32Val = RCC_Sysctrl_GetHClkFreq();
    u32Val = (u32Val >> (CW_SYSCTRL->CR0_f.PCLKPRS));
    return u32Val;
}

/**
 * @brief  Enable HSI
 * @param  HSIDiv:
 *   RCC_HSIOSC_DIV1
 *   RCC_HSIOSC_DIV2
 *   RCC_HSIOSC_DIV3
 *   RCC_HSIOSC_DIV4
 *   RCC_HSIOSC_DIV6
 *   RCC_HSIOSC_DIV8
 *   RCC_HSIOSC_DIV10
 *   RCC_HSIOSC_DIV12
 *   RCC_HSIOSC_DIV14
 *   RCC_HSIOSC_DIV16
 *
 * @retval None
 */
void RCC_HSI_Enable(uint32_t HSIDiv)
{
    assert_param(IS_RCC_HSIOSC_DIV(HSIDiv));

    // CW_SYSCTRL->HSI_f.DIV = HSIDiv;
    CW_SYSCTRL->HSI = (HSIDiv << SYSCTRL_HSI_DIV_Pos) | (*((volatile uint16_t *)RCC_HSI_TRIMCODEADDR)); //正式版芯片才需要加载Trim值
    CW_SYSCTRL->CR1 |= SYSCTRL_BYPASS | SYSCTRL_CR1_HSIEN_Msk;                                          // Enable HSI
    while ((CW_SYSCTRL->HSI & SYSCTRL_HSI_STABLE_Msk) != SYSCTRL_HSI_STABLE_Msk)                        // Wait stable
    {
        ;
    }
}

/**
 * @brief  Disable HSI
 * @param  None.
 * @retval None.
 */
void RCC_HSI_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) &
                       (~SYSCTRL_CR1_HSIEN_Msk));
}

/**
 * @brief  Enable LSI
 * @param  None:
 * @retval None
 */
void RCC_LSI_Enable(void)
{
    CW_SYSCTRL->LSI = *((uint16_t *)RCC_LSI_TRIMCODEADDR);                       //正式版芯片才需要加载Trim值
    CW_SYSCTRL->LSI |= RCC_LSI_WAITCYCLE_258;                                    // WaitCycle = 258
    CW_SYSCTRL->CR1 |= SYSCTRL_BYPASS | SYSCTRL_CR1_LSIEN_Msk;                   // Enable LSI
    while ((CW_SYSCTRL->LSI & SYSCTRL_LSI_STABLE_Msk) != SYSCTRL_LSI_STABLE_Msk) // Wait stable
    {
        ;
    }
}

/**
 * @brief  Disable LSI
 * @param  None.
 * @retval None.
 */
void RCC_LSI_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_BYPASS_MASK)) | SYSCTRL_BYPASS) &
                       (~SYSCTRL_CR1_LSIEN_Msk));
}

/**
* @brief  Enable HSE
* @param  Mode:   RCC_HSE_MODE_OSC: Oscillator,
*                 RCC_HSE_MODE_CLK: Input Clk
*
* @param  FreqIn: 4000000Hz ~ 32000000Hz
*
* @param  Driver: RCC_HSE_DRIVER_LEAST,
*                 RCC_HSE_DRIVER_SMALL,
*                 RCC_HSE_DRIVER_NORMAL, (default)
*                 RCC_HSE_DRIVER_LARGER
*
* @param  Flt: RCC_HSE_FLT_OPEN,
*              RCC_HSE_FLT_CLOSE
*
* @retval None

16M驱动配置建议：
Range:  建议配置为2
Driver：建议配置为1或者2

